{
  "＊ 符號表示重要常用功能": "＊ Indicates important and commonly used features.You may ignore the others.",
  "pipe-t-1": "The nearest namespace will be used automatically.\nThis applies to the same service",
  "lang-des": "Current active language as a signal.\nUsed for reactive bindings inside components that prefer signals over observables.\nAlways kept in sync with currentLang and onLangChange.",
  "currentLang-des": "Current active language code.\nSnapshot value of the language, useful in imperative code paths.\nEquivalent to lang() but easier to use in plain TypeScript.",
  "currentLang-ex": "ex. 'en', 'zh-Hant', 'ja'.",
  "supportedLangs-des": "List of supported language codes resolved from the host configuration.\nUsed to validate requested languages and avoid loading unknown locales.",
  "supportedLangs-ex": "ex. ['en', 'zh-Hant', 'ja'].",
  "readySignal-des": "Namespace readiness flag as a signal.\nFlips to true once the current namespace's translation resources are loaded for the active language (and build version).\n\nTypical usage:\n",
  "readySignal-i-1": "Guard templates with *ngIf=\"translation.readySignal()\"",
  "ready-des": "Convenience boolean wrapper around readySignal.\nReturns true when the current namespace is fully loaded for the active language.",
  "onLangChange-des": "Observable mirror of the language signal.\nProvided for consumers that still rely on RxJS instead of signals.",
  "onLangChange-emit": "emits:",
  "onLangChange-emit-1": "New language code every time setLang() is called successfully.",
  "onLangChange-usage": "Typical usage:",
  "onLangChange-usage-1": "Subscribe from non-signal-aware services or legacy code that needs to react to language changes.",
  "setLang-des": "Switches the active language and triggers downstream refresh logic.\nAlso causes:\n- lang signal to update\n- currentLang to change\n- onLangChange to emit.\n\nThe caller is responsible for passing a language contained in supportedLangs.",
  "setLang-ex": "ex.\nsetLang('en')\nsetLang('zh-Hant').",
  "t-des": "Executes the 'translate' action.\n Resolves the translated string for the specified key within the service's current namespace.\nIf params are passed, the string is formatted with these parameters using ICU formatting, and the pre-configured fallback behavior is applied for missing keys",
  "t-behavior": "Behavior:",
  "t-behavior-i-1": "1. If the namespace is not ready, returns an empty string and emits a debug warning when debug is enabled.",
  "t-behavior-i-2": "2-0. If enablePageFallback is turned on, the translation resources configured for components set to page scope will be used as a fallback.",
  "t-behavior-i-3": "2-1. If the key cannot be found in the current namespace, the system will attempt to find the translation in the configured fallback / global namespaces.",
  "t-behavior-i-4": "3. If still missing, falls back according to missingTranslationBehavior ('show-key' | 'empty' | 'throw-error' | custom string).",
  "t-ex": "ex.\nt('welcome.title')\nt('user.greeting', { name: 'Alice' }).",
  "addResourceBundle-des": "Pass-through helper to register a full resource bundle into the underlying core.\nUseful for dynamically injecting translations at runtime (for example, from an API or feature module).",
  "addResources-des": "Adds multiple translation entries into an existing bundle.\nIntended for incremental extension of a namespace without replacing the entire bundle.",
  "addResource-des": "Adds or overwrites a single translation entry in the core resource store.\nTypically used for one-off overrides or test setups.",
  "hasResourceBundle-des": "Checks whether a resource bundle is already loaded for a given language and namespace (and build version).\nUseful to avoid duplicate loading or to implement custom preload logic.",
  "getResource-des": "Retrieves a single raw translation entry from the core resource store.\nReturns the unformatted value (for example, an ICU string), not the formatted result.\nPrimarily intended for advanced use cases or debugging.",
  "getResourceBundle-des": "Retrieves the entire resource bundle object for a given language and namespace.\nAllows low-level inspection or custom tooling around the loaded translations.",
  "removeResourceBundle-des": "Removes a resource bundle from the core store.\nCan be used to free memory or to force a reload of a namespace for a given language.",
  "preloadNamespaces-des": "Preloads one or more namespaces ahead of time using the configured loader.\nUseful for eagerly loading common namespaces before navigation and reducing the chance of seeing empty content on first render.",
  "preloadNamespaces-ex": "ex.\npreloadNamespaces(['common', 'main-menu'])."
}
