{
  "＊ 符號表示重要常用功能": "＊ Indica funciones importantes y de uso frecuente. Puedes omitir las demás.",
  "pipe-t-1": "Se usará automáticamente el namespace más cercano.\nEsto también aplica al mismo servicio",
  "lang-des": "Idioma actual como signal.\nPara bindings reactivos en componentes que prefieren signals en lugar de observables.\nSiempre sincronizado con currentLang y onLangChange.",
  "currentLang-des": "Código de idioma activo actual.\nValor snapshot del idioma, útil en flujos imperativos.\nEquivalente a lang(), pero más cómodo en TypeScript puro.",
  "currentLang-ex": "Ej.: 'en', 'zh-Hant', 'ja'.",
  "supportedLangs-des": "Lista de códigos de idioma soportados resuelta desde la configuración.\nSe usa para validar idiomas solicitados y evitar cargar locales desconocidos.",
  "supportedLangs-ex": "Ej.: ['en', 'zh-Hant', 'ja'].",
  "readySignal-des": "Estado de preparación del namespace como signal.\nCambia a true cuando los recursos del namespace actual se cargan para el idioma activo (y build version).\n\nUso típico:\n",
  "readySignal-i-1": "Proteger plantillas con *ngIf=\"translation.readySignal()\"",
  "ready-des": "Wrapper booleano de readySignal.\nDevuelve true cuando el namespace actual está completamente cargado para el idioma activo.",
  "onLangChange-des": "Espejo Observable del signal de idioma.\nPara consumidores que aún dependen de RxJS en lugar de signals.",
  "onLangChange-emit": "emite:",
  "onLangChange-emit-1": "Nuevo código de idioma cada vez que setLang() se ejecuta correctamente.",
  "onLangChange-usage": "Uso típico:",
  "onLangChange-usage-1": "Suscríbete desde servicios sin signals o código legado que necesite reaccionar a cambios de idioma.",
  "setLang-des": "Cambia el idioma activo y dispara la lógica de actualización.\nTambién provoca:\n- actualizar el signal lang\n- cambiar currentLang\n- emitir onLangChange.\n\nEl llamador debe pasar un idioma incluido en supportedLangs.",
  "setLang-ex": "Ej.:\nsetLang('en')\nsetLang('zh-Hant').",
  "t-des": "Ejecuta la acción de traducción.\nResuelve la cadena traducida para la key especificada dentro del namespace actual.\nSi se pasan params, se formatea con ICU y se aplica el fallback configurado para keys faltantes.",
  "t-behavior": "Comportamiento:",
  "t-behavior-i-1": "1. Si el namespace no está listo, devuelve una cadena vacía y emite un warning cuando debug está activo.",
  "t-behavior-i-2": "2-0. Si enablePageFallback está activado, se usará como fallback el namespace de página configurado.",
  "t-behavior-i-3": "2-1. Si no se encuentra la key en el namespace actual, se intenta en los namespaces de fallback/global configurados.",
  "t-behavior-i-4": "3. Si aún falta, aplica missingTranslationBehavior ('show-key' | 'empty' | 'throw-error' | cadena personalizada).",
  "t-ex": "Ej.:\nt('welcome.title')\nt('user.greeting', { name: 'Alice' }).",
  "addResourceBundle-des": "Helper passthrough para registrar un bundle completo en el core.\nÚtil para inyectar traducciones en runtime (p. ej., desde una API o módulo de feature).",
  "addResources-des": "Agrega múltiples entradas de traducción en un bundle existente.\nPensado para extender un namespace de forma incremental sin reemplazarlo por completo.",
  "addResource-des": "Agrega o sobrescribe una sola entrada de traducción en el core.\nSuele usarse para overrides puntuales o setups de prueba.",
  "hasResourceBundle-des": "Verifica si un bundle ya está cargado para un idioma y namespace (y build version).\nÚtil para evitar cargas duplicadas o implementar preloads personalizados.",
  "getResource-des": "Obtiene una entrada de traducción cruda del core.\nDevuelve el valor sin formatear (por ejemplo, una cadena ICU), no el resultado formateado.\nPensado para casos avanzados o depuración.",
  "getResourceBundle-des": "Obtiene el bundle completo de un idioma y namespace.\nPermite inspección de bajo nivel o tooling personalizado sobre traducciones cargadas.",
  "removeResourceBundle-des": "Elimina un bundle del core.\nPuede usarse para liberar memoria o forzar la recarga de un namespace para un idioma.",
  "preloadNamespaces-des": "Precarga uno o más namespaces usando el loader configurado.\nÚtil para cargar namespaces comunes antes de la navegación y reducir el contenido vacío en el primer render.",
  "preloadNamespaces-ex": "Ej.:\npreloadNamespaces(['common', 'main-menu'])."
}
